{
    "UK": {
        "GCSE": {
            "Citizenship Studies": [
                "Know and understand what democracy is, how parliamentary democracy operates within the constituent parts of the UK, how government works, and how democratic and non-democratic systems of government are different beyond the UK.",
                "Know and understand the relationship between the state and citizens, the rights, responsibilities, and duties of citizens living and working in the UK, and how people participate in democracy.",
                "Know and understand the role of the law in society, how laws are shaped and enforced, and how the justice system works in England and Wales.",
                "Know and understand how taxes are raised and spent by governments, and how national economic and financial policies and decisions relate to individuals.",
                "Use and apply knowledge and understanding of key citizenship ideas and concepts, including democracy, government, justice, equality, rights, responsibilities, participation, community, identity, and diversity, to think deeply and critically about political, social, economic, and ethical issues in local to global contexts.",
                "Use and apply knowledge and understanding as they formulate citizenship enquiries, explore and research citizenship issues and actions, analyse and evaluate information, and interpret sources of evidence.",
                "Use and apply citizenship knowledge and understanding to contribute to debates, show understanding of different viewpoints, make persuasive and reasoned arguments, and justify and substantiate their conclusions.",
                "Use and apply citizenship knowledge, understanding, and skills in order to participate in responsible actions to address citizenship issues aimed at improving society and positively contributing to democracy and public life."
            ],
            "Sociology": [
                "Apply sociological knowledge, skills, and understanding to develop an understanding of the tensions and relationships between individual agency and social structures within both a UK and global context.",
                "Use evidence and critically analyse information to reach substantiated judgements, make informed arguments, and draw conclusions.",
                "Apply knowledge and understanding of how social processes and structures influence power, social control, and inequality.",
                "Utilize sociological theories to understand social debates, issues, continuities over time, and social changes.",
                "Understand and evaluate various research methods and sociological methodology.",
                "Appropriately use sociological terminology and create connections between key areas of the subject content."
            ],
            "Psychology": [
                "Cognitive psychology: Understand and apply concepts related to memory and perception.",
                "Social psychology: Investigate social influence, conformity, and obedience.",
                "Developmental psychology: Understand child development and the various stages of growth.",
                "Biological psychology: Explore the role of the brain and nervous system in explaining human behavior."
            ],
            "Economics": [
                "Increase students' understanding of the world and enable them to engage more effectively with economic issues on local, national, and global scales.",
                "Develop economic knowledge and skills, enabling students to read and comprehend articles written by leading economists.",
                "Teach students to build logical economic arguments using appropriate terminology and concepts.",
                "Enable students to understand how markets operate and the roles played by consumers, producers, and workers.",
                "Enable students to understand how the national and global economy works, including the levers used by governments to achieve objectives.",
                "Understand perspectives of different agents (producers, government, consumers) and consider moral, ethical, and sustainability issues.",
                "Develop effective, self-motivated, critical, and reflective thinkers who can distinguish between fact and opinion in economic debate.",
                "Apply economic knowledge to investigate situations and build arguments using quantitative evidence through interpretation of data."
            ],
            "History": [
                "Understand the significance of historical events, the role of individuals in history, and the nature of change over time.",
                "Gain a deeper understanding of the past through political, social, economic, and cultural perspectives.",
                "Demonstrate knowledge and understanding of the key features and characteristics of the historical periods studied."
            ],
            "Geography": [
                "Demonstrate knowledge of locations, places, processes, environments and different scales.",
                "Demonstrate geographical understanding of concepts and how they are used in relation to places, environments and processes.",
                "Apply knowledge and understanding to interpret, analyse and evaluate geographical information and issues to make judgements.",
                "Select, adapt and use a variety of skills and techniques to investigate geographical questions and issues and communicate findings."
            ],
            "Social Studies (WJEC)": [
                "Gather, justify, present, analyse, and evaluate a range of evidence related to society and social issues.",
                "Demonstrate a growing ability to transfer existing skills and knowledge into new and increasingly unfamiliar contexts.",
                "Identify and engage with social issues and explore various viewpoints relating to social action and social change.",
                "Demonstrate knowledge and understanding of core terms, concepts (authority, governance, community), and evidence relevant to the study of society."
            ]
        },
        "A Level": {
            "Sociology": [
                "Acquire knowledge and a critical understanding of contemporary social processes and social changes.",
                "Appreciate the significance of theoretical and conceptual issues in sociological debate.",
                "Understand and evaluate sociological methodology and a range of research methods through active involvement in the research process.",
                "Develop skills that enable individuals to focus on their personal identity, roles, and responsibilities within society.",
                "Develop a lifelong interest in social issues."
            ],
            "Psychology": [
                "Develop a deep understanding of major fields including clinical, health, organizational, forensic, and neuroscience.",
                "Engage with core areas of the discipline from a theoretical and empirical perspective.",
                "Apply research methods and data analysis skills across various vocational contexts within and outside of psychology.",
                "Present theoretical arguments and research results in a cogent and critical manner."
            ],
            "Economics": [
                "Develop an interest and enthusiasm for economics and appreciate how it contributes to the wider economic and social environment.",
                "Develop an understanding of a range of concepts and the ability to use those concepts across a variety of different contexts.",
                "Use an enquiring, critical, and thoughtful approach to studies while developing the ability to think specifically as an economist.",
                "Understand that economic behavior can be studied from a range of different perspectives.",
                "Develop analytical and quantitative skills that prepare students for the challenges and responsibilities of future careers."
            ],
            "History": [
                "Cover at least a 200 year period of history and more than one state to provide breadth and depth.",
                "Explain and analyse historical events and periods studied using second-order historical concepts such as cause and consequence.",
                "Analyse, evaluate and make substantiated judgements about interpretations, including how and why historians' views differ."
            ],
            "Geography": [
                "Develop knowledge of locations, places, processes, and environments, at all geographical scales from local to global.",
                "Develop an in-depth understanding of selected core and non-core processes in physical and human geography at a range of temporal and spatial scales.",
                "Recognize and analyse the complexity of people-environment interactions and appreciate how these underpin understanding of key world issues.",
                "Gain understanding of specialized concepts including systems, equilibrium, feedback, inequality, globalization, interdependence, mitigation, and resilience."
            ],
            "Politics": [
                "Develop knowledge and an informed understanding of contemporary political structures and issues within their historical context.",
                "Develop a critical awareness of the changing nature of politics and the specific relationships between political institutions and ideas.",
                "Develop knowledge and an informed understanding of the various interests and influences that impact decisions in politics and government.",
                "Encourage the development of knowledge regarding the rights and responsibilities of both groups and individuals.",
                "Develop the ability to critically interpret, analyse, and evaluate political information to form arguments and make judgements.",
                "Develop a student's interest in and engagement with contemporary politics."
            ]
        }
    },
    "Canada": {
        "British Columbia": {
            "Social Studies 10": [
                "Global Conflict: Global and regional conflicts have been a powerful force in shaping our contemporary world and identities.",
                "Political Institutions: The development of political institutions is influenced by economic, social, ideological, and geographic factors.",
                "Perspectives: Worldviews lead to different perspectives and ideas about developments in Canadian society.",
                "Injustice & Identity: Historical and contemporary injustices challenge the narrative and identity of Canada as an inclusive, multicultural society.",
                "Inquiry Skills: Use Social Studies inquiry processes and skills to ask questions; gather, interpret, and analyze ideas; and communicate findings and decisions."
            ],
            "Explorations in Social Studies 11": [
                "Innovation: Social, cultural, and technological innovations and developments can be a force for both continuity and change.",
                "Belief Systems: Diverse belief systems and worldviews shape historical and contemporary societies.",
                "Social Action: Social justice initiatives can transform individuals and systems.",
                "Human-Environment Interaction: Geographic conditions and human interactions shape the physical environment and human culture."
            ],
            "20th Century World History 12": [
                "Nationalism: Nationalist movements can unite people in common causes or lead to intense conflict.",
                "Technology: The rapid development and proliferation of technology in the 20th century has profoundly altered the human experience.",
                "Imperialism: The breakdown of long-standing imperialist structures created new economic and political systems."
            ],
            "Human Geography 12": [
                "Data Analysis: Analyzing data from a variety of sources allows us to better understand our globally connected world.",
                "Demographics: Demographic patterns and trends are influenced by a variety of physical, political, economic, and social factors.",
                "Landscape Modification: Human activities alter landscapes in a variety of ways."
            ],
            "Law Studies 12": [
                "Participation: Understanding legal rights and responsibilities allows citizens to participate more fully in society.",
                "Legal Evolution: Laws can maintain the status quo, but they can also be a force for change.",
                "Impact of Law: A society’s laws and legal framework affect people’s daily lives."
            ],
            "Economic Theory 12": [
                "Historical Context: Contemporary economic theory is grounded in the observation of historical economic activity.",
                "Role of Government: Differing economic theories lead to conflicting views on the role of government.",
                "Socio-Political Influence: Economic systems and theories are influenced by the social and political context of their time."
            ],
            "Social Justice 12": [
                "Interconnection: Social justice issues are interconnected.",
                "Worldview: Individual worldviews shape and inform our understanding of social justice issues.",
                "Complexity of Injustice: The causes of social injustice are complex and have lasting impacts on society.",
                "Transformation: Social justice initiatives can transform individuals and systems."
            ],
            "BC First Peoples 12": [
                "Identity & Land: The identities, worldviews, and languages of B.C. First Peoples are renewed, sustained, and transformed through their connection to the land.",
                "Colonialism: The impact of contact and colonialism continues to affect the political, social, and economic lives of B.C. First Peoples.",
                "Resiliency: Cultural expressions convey the richness, diversity, and resiliency of B.C. First Peoples."
            ],
            "Political Studies 12": [
                "Decision Making: Understanding how political decisions are made is critical to being an active and informed citizen.",
                "Ideologies: Political institutions and ideologies shape both the exercise of power and the nature of political participation.",
                "Power Dynamics: Decision making in a democratic society involves balancing the rights and interests of individuals and groups."
            ],
            "Comparative Cultures 12": [
                "Cultural Expression: Understanding the diversity of human cultures and expressions is fundamental to being a global citizen.",
                "Systems of Power: Geographic and environmental factors shape the development of civilizations.",
                "Value Systems: Religious and cultural practices that emerged during this period have endured and continue to influence people."
            ]
        },
        "Alberta": {
            "Social Studies 10-1: Perspectives on Globalization": [
                "Identity: Students will explore multiple perspectives on the origins of globalization and the local, national and international impacts of globalization on identity, lands, cultures, economies, human rights and quality of life.",
                "Historical Legacies: Analyze the legacies of historical globalization and Indigenous contact.",
                "Economic/Environmental: Analyze the political and economic challenges and opportunities of globalization.",
                "Citizenship: Evaluate their roles and responsibilities in a globalizing world."
            ],
            "Social Studies 10-2: Living in a Globalizing World": [
                "Historical Aspects: Students will explore the historical aspects of globalization and the effects of globalization on lands, cultures, human rights and quality of life.",
                "Personal Impact: Examine the impact of globalization on their lives."
            ],
            "Social Studies 20-1: Perspectives on Nationalism": [
                "Nation & Identity: Explore the concept of nation and how it can be a source of identity.",
                "Nation-State: Analyze the relationship between nation and nation-state.",
                "National Interest: Analyze the relationship between nationalism and the pursuit of national interest.",
                "Internationalism: Evaluate the extent to which the pursuit of national interest should be balanced with internationalism.",
                "Canadian Unity: Evaluate the challenges and opportunities associated with the promotion of Canadian national unity."
            ],
            "Social Studies 20-2: Understandings of Nationalism": [
                "Francophone/Indigenous: Students will examine historical and contemporary understandings of nationalism, acknowledging the contributions of First Nations, Métis, Inuit and Francophones to the development of Canada.",
                "Community Impact: Examine the effects of nationalism on individuals and communities."
            ],
            "Social Studies 30-1: Perspectives on Ideology": [
                "Identity & Ideology: Evaluate the extent to which ideology should be the foundation of identity.",
                "Liberalism & Resistance: Analyze the origins and evolution of classical liberalism.",
                "Alternative Systems: Analyze ideologies that developed in response to liberalism (e.g., socialism, Marxism).",
                "Viability of Liberalism: Evaluate the extent to which the principles of liberalism are viable in the context of contemporary issues (e.g., environment, pandemics, terrorism).",
                "Citizenship Action: Develop strategies to address local, national and global issues that demonstrate individual and collective responsibility."
            ],
            "Social Studies 30-2: Understandings of Ideologies": [
                "Ideology Values: Students will examine the origins, values and components of competing ideologies.",
                "Political Systems: Explore various political and economic systems and the role of the individual."
            ]
        },
        "Saskatchewan": {
            "Social Studies 10: Social Organizations": [
                "Power (PA): Analyze the decision-making processes in a variety of political structures.",
                "Authority (PA): Investigate the role of power and authority in the lives of individuals and groups.",
                "Wealth (RW): Analyze the production, distribution, and consumption of goods and services in various economic systems.",
                "Interdependence (IN): Analyze the global interdependence of nations and peoples."
            ],
            "Social Studies 20: World Issues": [
                "Human Rights Foundations: Know that human rights are those rights that an individual is entitled to simply because she or he is human.",
                "Universal Rights: Know that human rights are universal and as such apply to all people regardless of nationality, race, religion, political beliefs, age or gender.",
                "Population: Analyze the impact of population growth on resources and the environment.",
                "Environment: Examine various worldviews about the relationship between humanity and the natural environment.",
                "Wealth Disparity: Analyze the causes and consequences of economic disparity."
            ],
            "Social Studies 30: Canadian Studies": [
                "Change: Evaluate the influence of historical events on the Canadian identity.",
                "Economic Development: Analyze the relationship between the geography of Canada and the standard of living.",
                "Culture: Investigate the diverse cultures that comprise Canada.",
                "Governance: Analyze the structure and function of the Canadian government.",
                "Globalization: Evaluate Canada’s role in the global community."
            ],
            "History 30: Canadian Studies": [
                "People & Land: Analyze the relationship between the people and the land in Canada.",
                "Early Contact: Evaluate the impact of the fur trade and early European settlement.",
                "Democracy: Analyze the road to democracy and Confederation.",
                "Nationalism: Evaluate the forces of nationalism in Canadian history.",
                "Treaty Education: Examine one’s position regarding the importance of the treaty relationship for the social, cultural, and economic prosperity of all Saskatchewan and Canadian people."
            ],
            "Law 30": [
                "Purpose of Law: Evaluate the purpose and function of law in societies.",
                "Worldviews: Identify the influence of societal worldviews on the organization of historical and contemporary legal systems (e.g., Indigenous legal systems, Sharia law).",
                "Rule of Law: Explain why the rule of law principle is a fundamental principle in democratic societies.",
                "Legal Context: Investigate elements that influence Canada’s legal system such as: the Constitution Act (1982) including The Charter of Rights and Freedoms."
            ]
        },
        "Manitoba": {
            "Social Studies 10F (Canada in the Contemporary World)": [
                "Diversity: Students will explore the physical and human geography of Canada and the demography of the Canadian population.",
                "Governance: Students will examine the Canadian parliamentary system and the democratic rights and responsibilities of citizens.",
                "Global Context: Students will explore Canada’s role in the global community, including international relations and foreign aid.",
                "Challenges: Students will analyze contemporary issues facing Canada."
            ],
            "Geographic Issues of the 21st Century (20F)": [
                "Geographic Knowledge: Value the importance of geographic knowledge and understanding in making informed decisions.",
                "Place & Identity: Appreciate the importance of place to their identity.",
                "Earth Responsibility: Respect the Earth as a complex environment in which humans have important responsibilities.",
                "Resource Perspectives: Be willing to consider diverse views regarding the use of natural resources.",
                "Personal Choices: Be willing to consider the implications of personal choices regarding natural resources.",
                "Global Impact: Be willing to consider the social and environmental impacts of their consumer choices."
            ],
            "History of Canada (30F)": [
                "Indigenous Peoples: The relationship between First Nations, Métis, and Inuit peoples and the Canadian state is complex and evolving.",
                "Language Duality: The relationship between Francophones and Anglophones has been a central dynamic in Canadian history.",
                "Identity: Canadian identity is shaped by the diversity of its people and the struggle for inclusion.",
                "Governance Evolution: Canada’s political and economic systems have evolved over time to address changing needs.",
                "World Role: Canada’s role in the world has shifted from colony to independent nation to global actor."
            ],
            "Global Issues: Citizenship and Sustainability (40S)": [
                "Consumerism: Explain the history of consumerism and its impact on the environment and society.",
                "Media Influence: Analyze how media influence, affect, and control us.",
                "Environmental Planet: Describe and analyze how we are affected as a planet, as a nation, and as individuals.",
                "Wealth & Power: Analyze the distribution of wealth and power in the global community.",
                "Indigenous Resilience: Analyze the impact of colonization and the resilience of Indigenous peoples globally.",
                "Conflict & Peace: Explain the causes and consequences of global conflict."
            ]
        },
        "Ontario": {
            "Issues in Canadian Geography (CGC1D)": [
                "A. Inquiry: Use the geographic inquiry process and the concepts of geographic thinking when investigating issues relating to Canadian geography.",
                "B. Environment: Analyse various interactions between physical processes, phenomena, and events and human activities in Canada.",
                "C. Resources: Analyse impacts of resource policy, resource management, and consumer choices on resource sustainability in Canada.",
                "D. Population: Analyse selected national and global population issues and their implications for Canada.",
                "E. Communities: Analyse issues relating to the sustainability of human systems in Canada."
            ],
            "Civics and Citizenship (CHV2O)": [
                "A1. Political Inquiry: Use the political inquiry process and the concepts of political thinking when investigating issues, events, and developments of civic importance.",
                "B1. Civic Issues: Describe beliefs and values associated with democratic citizenship in Canada, and explain how they are related to civic action.",
                "B2. Governance: Explain roles and responsibilities of various institutions, structures, and figures in Canadian governance.",
                "B3. Rights: Analyse key rights and responsibilities associated with citizenship, in both the Canadian and global context.",
                "C1. Contributions: Analyse a variety of civic contributions and ways people can contribute to the common good."
            ],
            "Canadian History Since World War I (CHC2D)": [
                "A. Inquiry: Use the historical inquiry process and the concepts of historical thinking when investigating aspects of Canadian history since 1914.",
                "B. 1914–1929: Describe some key social, economic, and political events, trends, and developments, and assess their significance.",
                "C. 1929–1945: Analyse some key interactions within and between communities in Canada from 1929 to 1945.",
                "D. 1945–1982: Analyse how various individuals, groups, and events contributed to the development of identity, citizenship, and heritage.",
                "E. 1982–Present: Analyse significant interactions between Canada and the international community from 1982 to the present."
            ],
            "Understanding Canadian Law (CLU3M)": [
                "Historical Foundations: Explain the historical and philosophical foundations of Canadian law.",
                "Legal System: Analyze the structure and function of the Canadian legal system.",
                "Law & Society: Analyze the relationship between law and society.",
                "Rights Protections: Assess the protection of rights and freedoms in Canada."
            ],
            "Analysing Current Economic Issues (CIA4U)": [
                "A. Inquiry: Use the economic inquiry process and the concepts of economic thinking when investigating current economic issues.",
                "B. Scarcity: Demonstrate an understanding of the significance of the concept of scarcity and how it influences economic choices.",
                "C. Firms: Demonstrate an understanding of markets and theories of the firm.",
                "D. Macroeconomics: Demonstrate an understanding of various macroeconomic models and measures, including indicators of inequality.",
                "E. International: Analyse various theories, models, and issues relating to international trade."
            ],
            "Canadian and International Politics (CPW4U)": [
                "State Actors: Analyze the role of the state and non-state actors in the international community.",
                "Ideologies: Evaluate various political ideologies and systems.",
                "International Role: Assess Canada’s role in the international community."
            ]
        },
        "Quebec": {
            "Secondary III & IV: History and Citizenship Education": [
                "Competency 1 (Historical Perspective): The student interrogates social phenomena from a historical perspective, situating them in their context.",
                "Competency 2 (Historical Method): The student interprets social phenomena using the historical method, relying on the analysis of sources.",
                "Competency 3 (Citizenship): The student strengthens his/her consciousness of citizenship by exploring the history of Quebec and Canada."
            ],
            "Secondary V: Contemporary World": [
                "Competency 1 (Interpreting Problems): The student analyzes a problem of the contemporary world, identifying the actors, interests, and tensions involved.",
                "Competency 2 (Taking a Position): The student develops a critical opinion on a contemporary issue, supporting it with well-founded arguments."
            ],
            "Secondary V: Financial Education": [
                "Financial Taking Position: Takes a position on a financial issue.",
                "Personal Finance Management: Manages his/her personal finances.",
                "Consumption Critical Assessment: Critically assesses the consumption of goods and services.",
                "Legal Issues: Examine contemporary legal issues and their impact on Canadian society."
            ]
        },
        "New Brunswick": {
            "Social Studies 10": [
                "Outcome 1: Placeholder for New Brunswick Outcome"
            ]
        },
        "Prince Edward Island": {
            "Social Studies 10": [
                "Outcome 1: Placeholder for Prince Edward Island Outcome"
            ]
        },
        "Nova Scotia": {
            "African Canadian Studies 11": [
                "Diversity and Identity: Demonstrate an understanding of the diversity of Africa and its various cultures and recognize their importance in shaping Canadian identity.",
                "Pre-Colonial History: Understand the history of pre-colonial African kingdoms leading up to the Transatlantic Slave Trade.",
                "Colonial Impact and Resistance: Comprehend the impact of colonial expansion on the African diaspora, including the conditions of enslavement and strategies of resistance.",
                "Research and Communication: Develop effective skills in historical research methods and communicate their findings clearly.",
                "Civil Rights: Critically analyze the persistent struggle of peoples of African descent in their pursuit of civil rights and equality.",
                "Empowerment: Investigate the significance of collective consciousness among peoples of African descent as a strategy for empowerment.",
                "Prior Knowledge (1.1): Share existing knowledge regarding African heritage to establish a foundational context for the course.",
                "Diversity of Africa (1.2): Examine the vast diversity of the African continent across its physical environments, cultures, languages, and nations.",
                "Cultural Identity (1.3): Describe their own cultural identity and explain its personal importance.",
                "Elements of Culture (1.4): Define the meaning of culture and identify its various constituent elements.",
                "Historiography (1.5): Examine key terms like historiography, ethnocentrism, Eurocentrism, and Afrocentrism to analyze their significance in the construction of identity.",
                "Afrocentricity (1.6): Investigate the origins of Afrocentricity within the history, geography, and culture of Africa.",
                "Origins of Humankind (1.7): Explore the scientific concept of Africa as the birthplace of humanity.",
                "Ancient Civilizations (2.1): Identify the historical and geographical locations of different ancient African civilizations.",
                "Ancient Kingdoms (2.2): Examine the political, economic, and social systems of ancient African kingdoms such as Kush, Aksum, Ghana, and Mali.",
                "Pre-Colonial Cultures (2.3): Explore the various elements that characterized pre-colonial African cultures.",
                "Cultural Effects (2.4): Analyze how pre-colonial cultural components influenced African history and the transitions to the colonial era.",
                "Systems of Slavery (3A.1): Identify the colonial and imperial systems that were the root causes of slavery.",
                "Transatlantic Slave Trade (3A.2): Examine the routes, conditions, and economic drivers of the Transatlantic Slave Trade.",
                "Migration (3A.3): Compare displacement, voluntary migration, and forced migration as they relate to African peoples throughout the diaspora.",
                "Global Impact of Enslavement (3A.4): Investigate how enslavement has historically shaped global economics and politics.",
                "Slave Culture (3A.5): Explore the development of slave culture in North America and the Caribbean and analyze its effects on people of African descent.",
                "Resistance (3A.6): Examine the various means of resistance to enslavement, including cultural expression and anti-slavery movements.",
                "American Revolution (3B.1): Examine the causes and outcomes of the American Revolution and its implications for people of African descent.",
                "Immigration to Canada (3B.2): Investigate the reasons why Black Loyalists, Maroons, and Black Refugees immigrated to Canada.",
                "Underground Railroad (3B.3): Evaluate the impact of the Underground Railroad on the diaspora of African people in the United States and Canada.",
                "Civil War and Aftermath (3B.4): Analyze the implications of the American Civil War, the Emancipation Act, and Reconstruction for people of African descent.",
                "Settler Experiences (3B.5): Identify the challenges Black settlers faced in Canada, including discriminatory laws, environmental hardships, and settlement patterns.",
                "Confederation (3B.6): Examine the implications of Confederation and understand the contributions of African Canadians before and after 1867.",
                "Community Demographics (3B.7): Compare and contrast Black communities across Canada in the context of changing demographics, migration, and immigration policy after 1867.",
                "Research Proposal (4.1): Develop and refine a proposal for an inquiry-based or creative project.",
                "Work Plan (4.2): Create a work plan to manage time, monitor progress, and meet evaluation criteria.",
                "Research Question (4.3): Formulate a clear and focused question to guide their research.",
                "Conducting Research (4.4): Conduct organized research using diverse information sources that present multiple perspectives on African Canadian Studies.",
                "Organizing Findings (4.5): Organize their research findings using various methods such as graphs, charts, maps, and diagrams.",
                "Identifying Bias (4.6): Demonstrate the ability to identify bias, prejudice, stereotypes, and unsubstantiated claims in arguments and opinions.",
                "Comparing Interpretations (4.7): Compare key interpretations of topics within African Canadian studies.",
                "Analyzing Data (4.8): Explain relationships and connections within their data, such as cause and effect, chronology, and comparisons.",
                "Power and Racism (5.1): Examine the concept of power and its correlation with disenfranchisement, segregation, and racism as they affect people of African descent.",
                "Civil Rights Movement (5.2): Compare the history of the Civil Rights Movement in Africa, the United States, and Canada.",
                "Impact in Canada (5.3): Analyze the impact of the Civil Rights Movement on people of African descent in Canada, with a particular focus on Nova Scotia.",
                "Legal Documents (5.4): Investigate the significance of legal documents like the UN Charter of Rights and Freedoms and Canadian constitutional documents in this context.",
                "The Black Church (5.5): Examine the traditions of the Black church as an instrument for political, social, and educational leadership.",
                "Concept of Empowerment (6.1): Examine the concept of empowerment, including the Catalyst, Awareness, Analysis, and Action (CAAA) model, and investigate its impact on institutional change for people of African descent.",
                "Global Political Empowerment (6.2): Investigate the global impact of political empowerment and the independence of colonized countries from the 1950s onward.",
                "Community Organizations (6.3): Demonstrate how community-based and grassroots organizations have evolved over time.",
                "Contributions and Achievements (6.4): Understand the contributions and achievements of African Canadians across social, educational, political, and other institutions.",
                "Black Families (6.5): Examine the evolution of Black family structures in Canada.",
                "Contemporary Challenges (6.6): Examine the challenges that African Canadians and African Nova Scotians face today.",
                "Diasporic Consciousness (6.7): Understand the consciousness of people of African descent throughout the diaspora as it relates to the African continent."
            ],
            "Canadian History 11": [
                "Citizenship, Power, and Governance: Understand the rights and responsibilities of citizenship as well as the origins, functions, and sources of power, authority, and governance.",
                "Individuals, Societies, and Economic Decisions: Demonstrate the ability to make responsible economic decisions, both as individuals and as members of society.",
                "People, Place, and Environment: Develop an understanding of the complex interactions among people, places, and the environment throughout Canadian history.",
                "Culture and Diversity: Demonstrate an understanding of culture, diversity, and worldview, recognizing the similarities and differences that define the Canadian experience.",
                "G1: Understand how pre-contact and post-contact First Nations governing structures and practices were reflective of their societies.",
                "G2: Understand how and why competing French, British, and American governing philosophies merged in BNA.",
                "G3: Analyze how emerging political and economic structures led to Confederation.",
                "G4: Evaluate the evolution of federalism in Canada from Confederation to Patriation.",
                "G5: Analyze the shift from a traditional two-party process to a multi-party process in post-Confederation Canada.",
                "J5: Analyze the evolution of the struggle to achieve rights and freedoms."
            ],
            "Contemporary Canadian Studies 11": [
                "Advocating for Equity: Understand the legacy of civic engagement within Black communities and how Africentric principles guide these efforts.",
                "Rights Advocacy: Analyze how Black Nova Scotians and Canadians has advocated for their rights and driven reforms.",
                "Protecting Communities: Analyze the impacts of encroachment and gentrification on Black communities and understand the importance of securing clear land titles.",
                "Sustainability Initiatives: Investigate how individuals and organizations support initiatives for sustainability and growth.",
                "Programs and Services: Examine Collaboration with governments to provide equitable access to social services.",
                "Systemic Barriers: Analyze the impact of systemic barriers on education, healthcare, housing, and employment.",
                "Research Process: Employ different methods to conduct research and effectively communicate a structured argument.",
                "Source Analysis: Determine the validity, accuracy, and reliability of sources and identify biases.",
                "Impact of Perspectives: Identify different perspectives within sources and recognize how their own perspective influences understanding.",
                "Supporting Argument: Use evidence from a variety of print and digital sources to support an argument."
            ],
            "Economics 11": [
                "Scarcity: Understand that scarcity is the fundamental problem that forms the basis of economic study.",
                "Resources & Wants: Analyze the relationship between finite resources and infinite human wants.",
                "Opportunity Cost: Explain how opportunity cost affects every economic decision.",
                "Economic Systems: Compare how different economic systems (traditional, command, market) respond to scarcity.",
                "Canadian Economy: Evaluate how Canada's mixed market economy addresses scarcity.",
                "Field of Economics: Distinguish between academic economics and practical work by economists.",
                "Market Dynamics: Understand the relationship between supply, demand, and price.",
                "Business Organizations: Identify and compare various forms of business organizations in Canada.",
                "Market Types: Understand the impact of different market structures (monopoly, oligopoly, etc.) on consumers.",
                "Role of Government: Examine government roles in regulation, taxation, and public goods.",
                "Money Functions: Explain the forms, functions, and characteristics of money in Canada.",
                "Monetary Policy: Understand the Bank of Canada's role and tools for managing inflation/unemployment.",
                "Financial Management: Identify and practice methods of sound individual financial management.",
                "Investing & Credit: Analyze methods of investing, borrowing, and using credit.",
                "Measuring Economy: Understand how the Canadian economy works and is measured (GDP).",
                "Economic Growth: Analyze factors affecting production and economic growth (technology, investment).",
                "International Trade: Understand reasons for trade, effects of barriers, and importance to Canada.",
                "Exchange Rates: Understand how currency exchange rates are determined and their fluctuations.",
                "Global Economy: Predict the effect of the changing global economy on Canada.",
                "Environmental Economics: Analyze the relationship between economics and environmental sustainability.",
                "Standard of Living: Evaluate how economic choices affect standards of living.",
                "Income Disparity: Understand causes/effects of income disparity and evaluate assistance programs.",
                "Labour Organizations: Explain the role of labour unions and collective bargaining.",
                "Fiscal Policy: Understand government management of the economy through taxation and spending.",
                "Labour Market: Understand the determination of wages and causes of unemployment."
            ],
            "Global Sustainable Solutions 12": [
                "Indigenous Relationships: Analyze diverse relationships Indigenous peoples have with their land and impacts of colonial decisions.",
                "Conservation: Investigate Indigenous work to protect the environment using traditional knowledge.",
                "Water Scarcity: Analyze causes of water scarcity including demand and climate change.",
                "Sanitation & Health: Investigate links between sanitation and public health in perpetuating poverty.",
                "Water Management: Evaluate roles of stakeholders in sustainable water management strategies.",
                "Food Insecurity: Investigate impacts of food insecurity on health outcomes and global patterns.",
                "Food Production: Analyze how physical processes and human activity impact food security.",
                "Disaster Vulnerability: Investigate how location and climate change affect community resilience.",
                "Disaster Management: Compare mitigation, preparedness, response, and recovery strategies.",
                "Population Growth: Analyze physical/human factors influencing population distribution and growth.",
                "Demographic Policies: Investigate relationships between growth, gender equality, and human rights.",
                "Forced Migration: Compare conflict-induced and disaster-induced migration and climate impacts.",
                "Migration Effects: Evaluate effects of forced migration on sending/receiving communities.",
                "Urban Development: Investigate factors influencing urban development and population impacts.",
                "Urban Equity: Analyze how urban environmental and social stresses impact equity.",
                "Resilient Planning: Evaluate how urban planning can mitigate human impacts and create resilient cities.",
                "Sustainable Urbanism: Investigate community consultations, green tech, and Indigenous planning."
            ],
            "Social Studies 7": [
                "Mi'kmaw Policy: Reflect on the impact of government policies and denial of treaty rights on Mi'kmaw communities.",
                "Indian Act: Analyze how government decisions impacted conditions for Mi'kmaw people.",
                "Mi'kmaw Resilience: Investigate resilience in response to discriminatory policies.",
                "Maritime Communities: Investigate civic, geographic, and economic conditions on diverse peoples (Acadians, Black Nova Scotians, Gaels).",
                "Resistance: Evaluate effects of government attempts at assimilation and community resistance.",
                "Confederation Impact: Evaluate political and social impacts of Confederation on the Maritimes.",
                "Responsible Government: Examine origins and purpose of responsible government in the Maritimes.",
                "Confederation Controversy: Investigate controversy surrounding Confederation from multiple perspectives.",
                "Social Change: Investigate individuals and groups advocating for social change (1820-1920).",
                "Maritime Innovation: Analyze impacts of social movements and technological innovation.",
                "Contemporary Maritimes: Investigate how changing demographics and industry create new challenges.",
                "Environmental Sustainability: Evaluate human activity impact informed by Mi'kmaw Netukulimk."
            ],
            "Social Studies 8": [
                "Indigenous Experiences: Reflect on 20th and 21st-century Indigenous experiences in Canada.",
                "Assimilation Policies: Analyze purpose and impacts of the Indian Act and residential schools.",
                "Indigenous Advocacy: Analyze advocacy for rights (1982 Constitution, TRC).",
                "Social Justice: Evaluate the role of social justice in Canadian society.",
                "Inequity Issues: Investigate historical and contemporary issues of injustice in Canada.",
                "First-Voice Power: Analyze power of first-voice perspectives in inspiring resistance.",
                "Social Movements: Evaluate impact of movements in creating a more equitable society.",
                "Changing Society: Analyze factors (tech, environment) contributing to change in Canada.",
                "Entrepreneurship: Investigate the role of innovation and entrepreneurship in the economy.",
                "Conflict Impact: Evaluate how various conflicts (WWI, WWII) have impacted Canadian society.",
                "Reconciliation: Investigate the role and purpose of reconciliation in addressing conflicts.",
                "Media & Conflict: Examine role of media and journalism in shaping public understanding.",
                "WWII Rights: Evaluate impact of WWII on civil and human rights in Canada.",
                "WWII Contributions: Analyze human and material contributions of Canadians to war.",
                "Advocacy Action: Plan an advocacy action in response to a current issue of concern."
            ],
            "Sociology 12": [
                "Discipline of Sociology: Describe sociology as a social science and differentiate from anthropology/psychology.",
                "Theoretical Perspectives: Understand functionalism, conflict theory, symbolic interactionism, and feminism.",
                "Research Methods: Analyze sociological research methods, assessing strengths and weaknesses.",
                "Culture Elements: Understand culture through symbols, language, norms, and values.",
                "Cultural Variation: Analyze causes and consequences of cultural variation and uniformity.",
                "Canadian Culture: Explore subculture, counterculture, and multiculturalism in Canada.",
                "Socialization Process: Explain socialization and identify agents (family, media, peers).",
                "Socialization Theories: Investigate relationship between socialization and personality (Freud, Cooley, Mead).",
                "Group Roles: Describe the role of groups in organizing societies and shaping behavior.",
                "Social Stratification: Examine stratification in relation to gender, race, and status.",
                "Social Institutions: Examine major institutions, including the family.",
                "Social Control: Analyze formal and informal ways societies achieve conformity.",
                "Deviance Theory: Investigate deviance theories and cross-cultural responses.",
                "Crime Analysis: Investigate crime as a specific example of deviant behavior in Canada."
            ],
            "Tourism 11": [
                "Trends in Tourism: Research trends, issues, and innovations in tourism planning and development."
            ],
            "IB Global Politics SL/HL": [
                "Core Theme: Understanding power and its role in shaping political outcomes.",
                "Rights and Justice: Examine theory and practice of human rights and pursuit of justice.",
                "Development & Sustainability: Analyze approaches to development and challenges of sustainability.",
                "Peace and Conflict: Investigate causes of conflict and strategies for peace.",
                "HL Extension: Deeper exploration of specific global political challenges through case studies."
            ],
            "IB History SL/HL": [
                "Historical Skills: Develop critical thinking and understanding of multiple interpretations of the past.",
                "Military Leaders: In-depth study of military leadership and impact.",
                "Conquest & Impact: Analyze conquest and its consequences in different regions.",
                "Global War: Analyze the move to global war (WWI/WWII).",
                "Rights and Protest: Analyze struggle for rights and protest movements.",
                "Authoritarian States: Analyze 20th-century authoritarian regimes.",
                "Cold War: Analyze superpower tensions and rivalries."
            ],
            "IB Economics SL/HL": [
                "Micro/Macro Foundation: Strong foundation in microeconomic and macroeconomic theories.",
                "International Trade: Understand benefits of trade and types of protection.",
                "Trade Control: Analyze arguments for and against trade control/protection.",
                "Economic Integration: Analyze levels of economic integration.",
                "Exchange Rates & BoP: Understand determination of rates and balance of payments.",
                "Sustainable Development: Understand measuring and barriers to sustainable development."
            ],
            "IB World Religions (SL)": [
                "introductory Religions: Knowledge and understanding of five world religions.",
                "Religious Concepts: Define and use concepts associated with particular world religions.",
                "Tradition Comparison: In-depth understanding of two religions reflecting different traditions.",
                "Behavioural Expression: Demonstrate how key concepts are expressed in believer behaviour.",
                "Source Analysis: Research, select, and analyze primary and secondary religious sources.",
                "Synthesis & Evaluation: Evaluate concepts and synthesize evidence with critical commentary.",
                "Research Reliability: Evaluate reliability of evidence and research methods."
            ],
            "Citizenship 9": [
                "Service Learning: Construct a collaboratively-designed service learning project.",
                "Citizen Identity: Evaluate concepts of citizenship as members of different communities.",
                "Indigenous Rights: Evaluate changes in citizenship rights of Mi'kmaw and disempowered people.",
                "Economic Decisions: Compare impact of economic decisions from various perspectives.",
                "Financial Participation: Analyze how decision-making affects personal financial management.",
                "Digital Perceptions: Evaluate how media influences perceptions of current issues.",
                "Digital Risks: Evaluate risks, rights, and responsibilities of digital citizens.",
                "Governance Engagement: Evaluate strategies to meaningfully engage as citizens in democracy.",
                "Global Inaction: Evaluate consequences of action and inaction as global citizens."
            ],
            "Economics 12": [
                "Field of Economics: Demonstrate understanding of the field and work of economists.",
                "Decision-making: Understand factors and processes influencing economic decision-making.",
                "Productive Resources: Demonstrate understanding of land, labour, capital, entrepreneurship.",
                "Market Demand: Demonstrate understanding of the law of demand in the market.",
                "Market Supply: Demonstrate understanding of the law of supply in the market.",
                "Business Function: Demonstrate understanding of how various forms of business in Canada function.",
                "Market Structures: Demonstrate understanding of competition in different market structures.",
                "Labour Markets: Demonstrate understanding of labour market and unions.",
                "Economic Measurement: Demonstrate understanding of how economic performance is measured.",
                "Business Cycle: Demonstrate understanding of characteristics and impacts of business cycles.",
                "Government Role: Demonstrate understanding of role in a mixed market economy.",
                "Fiscal & Monetary Policy: Demonstrate understanding of impacts on the economy.",
                "Globalization: Demonstrate understanding of trade, exchange rates, and globalization.",
                "Sustainable Development: Demonstrate understanding of and its economic impact.",
                "Financial Institutions: Understand role of banks and financial planning."
            ],
            "Gàidhlig 11 / Gaelic 11": [
                "Classroom Interaction: Interact in a classroom where Gaelic is the language spoken.",
                "Spontaneous Communication: Interact effectively and with spontaneity in real-life situations.",
                "Cultural Expression: Narrate and describe events from personal experience in Gaelic.",
                "Creative Text: Create text reflective of material studied in Gaelic 11.",
                "Oral Tradition: Participate in recitation of poetry and singing songs.",
                "Nova Scotian Gaels: Gain understanding of the Nova Scotian Gael and modern society.",
                "Lifestyle Comparison: Compare/contrast contemporary and traditional lifestyles of Gaels.",
                "Gaelic Contributions: Investigate contributions of the Gaelic community to Canadian society.",
                "Historical Preservation: Examine use of song/story in preserving history of Gaels in Canada.",
                "First Nations Relations: Examine relations between First Nations and the Gaels."
            ],
            "Geography 10": [
                "Data Collection: Explain remote sensing (satellite imagery) and field techniques.",
                "Data Processing: Demonstrate image interpretation and map selection/creation.",
                "Geographic Perspective: View events using themes of place, location, region, human-environment, and movement.",
                "Tectonic Forces: Understand Earth's structure and interior forces shaping the planet.",
                "Glacial Processes: Understand impact on physical environment.",
                "Coastal Landscapes: Understand features shaped by wave action.",
                "Ocean Environment: Identify sea floor processes and ocean impact on atmosphere.",
                "Atmospheric Envelope: Analyze conditions necessary for life in the atmosphere.",
                "Precipitation Modes: Understand hydrologic cycle and precipitation types.",
                "Sustainability: Understand that humanity is part of physical-biological web."
            ],
            "Geography of Canada 11": [
                "Spatial Dimensions: Interpret dimensions within Canada and global community.",
                "Physical Systems: Analyze impact of physical systems on human activity.",
                "Ecumene Analysis: Analyze population statistics and distribution factors.",
                "Demographic Trends: Apply concepts to explain trends in population.",
                "Resource Development: Explain impact on settlement patterns and market shifts.",
                "Global Trade: Evaluate Canada's economic position within global trade framework.",
                "Environmental Risks: Understand issue of environmental racism and food security."
            ],
            "Geomatics 12": [
                "Career Exploration: Investigate geotechnologies and career opportunities in geomatics.",
                "GIS Evolution: Examine historical evolution of GIS software.",
                "Geographic Inquiry: Demonstrate understanding of the Geographic Method of Inquiry.",
                "Skill Building: Demonstrate GIS tool use for map creation and thematic maps.",
                "Data Application: Query data to solve problems and customize information display.",
                "Advanced GIS: Engage in collecting, geocoding, and mapping community features.",
                "Applied Project: Develop and document a community-based geomatics project plan."
            ],
            "Global Geography 12 / Advanced Global Geography 12": [
                "Data Manipulation: Predict geographic issues using GIS, spreadsheets, and web browsers.",
                "Planet Health: Evaluate the planetary state of health and ecosystems.",
                "Vital Statistics: Interpret aspects of global population using vital statistics.",
                "Global Food: Analyze factors affecting global production and distribution of food.",
                "Industrialization: Examine effects on quality of life throughout the world.",
                "Urban Models: Evaluate models of urban structure in developed and developing countries.",
                "Political Patterns: Examine evolution of contemporary global political pattern."
            ],
            "Global History 12 / Advanced Global History 12": [
                "Interdependence: Illustrate an understanding of the concept of global interdependence.",
                "Cold War Origins: Understand factors contributing to the East-West conflict.",
                "Economic Disparity: Examine issues illustrating disparity between North and South.",
                "Wealth and Power: Analyze correlation between wealth and power.",
                "Justice Concepts: Understand forces that shaped contemporary conceptions of justice.",
                "Genocide Analysis: Formulate a hypothesis regarding examples of genocide in 20th/21st century.",
                "Societal Change: Investigate relationship between technological and societal change."
            ],
            "Global Politics 12 / Advanced Global Politics 12": [
                "Political Ideologies: Investigate communism, fascism, capitalism, socialism, democracy.",
                "Governing Systems: Examine organization and operation of various political systems.",
                "Canadian System Roots: Examine historical roots (Parliamentary, BNA, Charter).",
                "Jurisdictional Powers: Investigate divisions of power among federal, provincial, and local.",
                "Comparative Systems: Compare and contrast Canadian and U.S. governing/electoral systems.",
                "International Relations: Describe organizations governing relations (UN, NATO, IMF).",
                "Media Influence: Analyze changing role of media/technology on global politics."
            ],
            "History 10": [
                "Ancient Civilizations: Understand characteristics defining ancient civilizations.",
                "Political Evolution: Investigate governance sources from prehistory to Roman Empire.",
                "Power & Cohesion: Examine how political power creates social cohesion or conflict.",
                "Imperial Origins: Understand factors giving rise to empires and their strengths.",
                "Religious Impact: Identify impact religion has on cultural development.",
                "Revolution Concept: Demonstrate historical understanding of revolution concept."
            ],
            "Law 12": [
                "Constitutional Process: Demonstrate understanding of law-making processes in Canada.",
                "Charter Impact: Analyze impact of Charter on administration of justice.",
                "Criminal Principles: Describe trial principles, procedures, and sentencing options.",
                "Civil vs Criminal: Differentiate and analyze torts, contracts, and family matters.",
                "Indigenous Law: Understand legal impact of Aboriginal Rights and Treaty Rights.",
                "Human Rights Safeguards: Evaluate extent to which human rights are safeguarded in Canada.",
                "Environmental Law: Evaluate effectiveness of environmental laws in resource sustainability."
            ],
            "Mi’kmaw Studies 11": [
                "Worldview: Demonstrate how personal background shapes interpretations of history.",
                "Oral Culture: Understand sophisticated oral culture and governance pre-contact.",
                "Treaties of Friendship: Investigate nationhood through agreements like the Concordat.",
                "Indian Act Effects: Evaluate adverse effects of discriminatory laws and social injustices.",
                "Cultural Identity: Investigate how oral tradition maintains Mi'kmaw consciousness.",
                "Residential Schools: Focus on origins, goals, and long-term traumatizing impacts.",
                "Reclaiming Autonomy: Demonstrate understanding of modern efforts to regain control."
            ],
            "Tourism 12": [
                "Sector Structure: Demonstrate detailed understanding of tourism sector interrelationships.",
                "Nova Scotia Markets: Investigate significant features of major local tourism markets.",
                "Professional Standards: Demonstrate knowledge, skills, and attitudes for the sector.",
                "Travel History: Demonstrate understanding of history and evolution of travel.",
                "Nova Scotia Regions: Demonstrate understanding of the tourism regions of Nova Scotia.",
                "Hospitality Business: Describe early history of hospitality and inn keeping."
            ],
            "IB Geography (SL & HL)": [
                "Global Change: Demonstrate knowledge of global change core themes.",
                "Global Interactions: Analyze global interactions and geographic interactions.",
                "Spatial Synthesis: Synthesize geographic information and evaluate methodological tools.",
                "Terminology: Produce well-structured written material using appropriate terminology."
            ]
        },
        "Newfoundland and Labrador": {
            "Social Studies 10": [
                "Outcome 1: Placeholder for Newfoundland and Labrador Outcome"
            ]
        }
    },
    "USA": {
        "Alabama": {
            "Grade 10: United States History I": [
                "Standard 1: Compare the development of the early English colonies in the North, Middle, and South, including their geographic, economic, and social differences.",
                "Standard 3: Trace the chronology of events leading to the American Revolution, including the French and Indian War, the Stamp Act, the Boston Tea Party, and the Intolerable Acts.",
                "Standard 4: Analyze the political, economic, and social impact of the American Revolution, including the Declaration of Independence and the Treaty of Paris (1783).",
                "Standard 7: Describe the political, social, and economic events between the American Revolution and the Civil War, including the rise of sectionalism, the Missouri Compromise, and the Nullification Crisis.",
                "Standard 11: Identify the causes, course, and consequences of the Civil War, including the roles of significant leaders (e.g., Abraham Lincoln, Jefferson Davis, Ulysses S. Grant, Robert E. Lee).",
                "Standard 12: Analyze the impact of Reconstruction on the United States, including the Thirteenth, Fourteenth, and Fifteenth Amendments."
            ],
            "Grade 11: United States History II": [
                "Standard 1: Interpret the impact of change from workshop to factory on workers' lives, including the New Industrial Age from 1870 to 1900, AFL-CIO, IWW, Pullman Strike, Haymarket Square Riot, and Sherman Antitrust Act.",
                "Standard 2: Determine the influence of the Niagara Movement, NAACP, Booker T. Washington, W. E. B. Du Bois, Marcus Garvey, and Carter G. Woodson on the Progressive Era.",
                "Standard 3: Analyze the involvement of the United States in the Hawaiian Islands for economic and imperialistic interests.",
                "Standard 4: Appraise Alabama's contributions to the United States between Reconstruction and World War I, including William Gorgas and Joseph Wheeler.",
                "Standard 7: Describe the impact of the Smoot-Hawley Tariff Act on the global economy and the resulting worldwide depression.",
                "Standard 10: Explain the isolationist debate as it evolved from the 1920s to the bombing of Pearl Harbor and subsequent change in US foreign policy."
            ],
            "Grade 12: United States Government": [
                "Standard 1: Explain the historical and philosophical foundations of the US government, including the Magna Carta, the Petition of Right, the English Bill of Rights, and the Mayflower Compact.",
                "Standard 4: Explain the structure and functions of the legislative, executive, and judicial branches of the federal government as outlined in the Constitution.",
                "Standard 8: Analyze the election process, including the role of political parties, interest groups, the media, and the Electoral College."
            ]
        },
        "Alaska": {
            "Alaska History Outcomes": [
                "SS.AKH.1.25.1: Evaluate the role of significant individuals across different eras of Alaska's history.",
                "SS.AKH.1.19.1: Examine the immediate and long‐term impacts of epidemics throughout Alaska's history.",
                "SS.AKH.1.16.1: Analyze the geopolitical importance of Alaska's strategic location in the circumpolar north.",
                "SS.AKH.1.16.2: Assess how natural and human‐made environmental changes affect the sustainability of contemporary and traditional practices.",
                "SS.AKH.1.19.3: Understand and contextualize the various perspectives on the peopling of Alaska before contact with the West.",
                "SS.AKH.1.16.4: Use evidence to document and explain the development and evolution of Alaska Native societies and cultures.",
                "SS.AKH.1.20.1: Explain the reciprocal relationships between Alaska's geography and development of Alaska Native societies.",
                "SS.AKH.1.23.1: Examine how conceptions and definitions of Tribal affiliations have shifted over time."
            ],
            "Land Claims and Sovereignty": [
                "SS.AKH.2.21.1: Compare and contrast Indigenous, Russian, and American understandings of land claims and land stewardship.",
                "SS.AKH.2.23.1: Analyze the social, political, cultural, and economic issues that emerged from the initial Russian and European contact in Alaska.",
                "SS.AKH.2.6.1: Analyze the role of the federal government's claims to Alaska's lands for military use, resources, trade, and infrastructure over time.",
                "SS.AKH.2.8.1: Analyze the legal contexts of Alaska's Land Claims Settlement Act and long‐term effects on Indigenous Tribal societies.",
                "SS.AKH.2.20.1: Assess the cultural‐political development of Alaska's Indigenous societies as a means of thriving on the land.",
                "SS.AKH.2.17.1: Cite and compare historical arguments about the purchase of Alaska from Indigenous, Russian, and American perspectives."
            ]
        },
        "Arizona": {
            "High School History": [
                "HS.H1.1: Evaluate how historical events and developments were shaped by unique circumstances of time and place as well as broader contexts.",
                "HS.H1.2: Analyze the relationship among different regional, social, ethnic, and racial groups and explain how these groups' experiences have related to national identities.",
                "HS.H1.3: Analyze how ideologies, religion, and belief systems have influenced economic, political, and social institutions over time.",
                "HS.H2.1: Explain multiple causes of conflict.",
                "HS.H2.2: Analyze the approaches of individuals and groups to solve problems and the consequences of their actions.",
                "HS.H3.1: Analyze how societies have adapted to and modified their environment.",
                "HS.H3.4: Evaluate how societies have balanced individual freedoms, responsibilities, and human dignity versus the common good."
            ],
            "High School Civics": [
                "HS.C1.1: Explain the origins, functions, and structure of the United States Constitution and the Bill of Rights.",
                "HS.C2.1: Analyze the role of citizens in the United States political system, including rights, responsibilities, and civic participation.",
                "HS.C3.1: Evaluate the impact of international agreements and organizations on the United States."
            ]
        },
        "Arkansas": {
            "United States History Since 1890": [
                "Outcome 1: Demonstrate proper etiquette for interacting with the Arkansas and American flags and analyze free speech rights.",
                "Outcome 2: Analyze national and international causes of the Great Depression: Political, Economic, and Environmental (Dust Bowl).",
                "Outcome 3: Analyze the expanded role of the federal government's domestic interventions and fiscal policy (New Deal agencies).",
                "Outcome 4: Evaluate the effectiveness of New Deal policies on various regions during the Great Depression.",
                "Outcome 5: Analyze the historical significance of key battles, events, and people during World War II, including the Holocaust.",
                "Outcome 6: Examine social, economic, and political implications of WWII, including end of isolationism and baby boom.",
                "Outcome 7: Analyze the origins, developments, and effects of Soviet-American rivalry in the Cold War (Marshall Plan, Containment)."
            ],
            "World History": [
                "Outcome 1: Analyze the development of social, economic, political, and geographic transformations of regional connections.",
                "Outcome 2: Analyze factors influencing perspectives (Enlightenment, Protestant Reformation, Renaissance, Scientific Revolution).",
                "Outcome 3: Construct historical arguments about significant transformations and innovations utilizing evidence from sources.",
                "Outcome 4: Analyze social, economic, and political ideas (self-determination, liberty, human rights) influencing revolutions.",
                "Outcome 5: Analyze written documents that both articulate and contest powers, responsibilities, and limits of governments."
            ]
        },
        "California": {
            "Grade 10: World History, Culture, and Geography": [
                "10.1: Relate moral/ethical principles in Greek/Roman philosophy and Judaism/Christianity to Western political thought.",
                "10.2: Compare Glorious Revolution, American Revolution, and French Revolution impacts on worldwide political expectations.",
                "10.3: Analyze effects of the Industrial Revolution in England, France, Germany, Japan, and the United States.",
                "10.4: Analyze patterns of global change in New Imperialism (Africa, SE Asia, China, India, Latin America, Philippines).",
                "10.5: Analyze the causes and course of the First World War.",
                "10.6: Analyze the effects of the First World War.",
                "10.7: Analyze the rise of totalitarian governments after World War I.",
                "10.8: Analyze the causes and consequences of World War II."
            ],
            "Grade 11: United States History and Geography": [
                "11.1: Analyze significant events in nation founding and attempts to realize principles in the Declaration of Independence.",
                "11.2: Analyze relationship between industrialization, rural-to-urban migration, and massive immigration.",
                "11.3: Analyze role of religion in founding America and its lasting moral, social, and political impacts.",
                "11.4: Trace the rise of the United States to its role as a world power in the twentieth century.",
                "11.5: Analyze major political, social, economic, technological, and cultural developments of the 1920s.",
                "11.6: Analyze explanations for the Great Depression and how the New Deal changed the role of the federal government.",
                "11.7: Analyze America's participation in World War II.",
                "11.8: Analyze the economic boom and social transformation of post-World War II America.",
                "11.9: Analyze U.S. foreign policy since World War II.",
                "11.10: Analyze the development of federal civil rights and voting rights."
            ],
            "Grade 12: Principles of American Democracy": [
                "12.1: Explain fundamental principles and moral values of American democracy in the Constitution and essential documents.",
                "12.2: Evaluate and defend positions on scope/limits of rights and obligations as democratic citizens.",
                "12.3: Evaluate and defend positions on fundamental values and principles of civil society (voluntary relations).",
                "12.4: Analyze unique roles and responsibilities of the three branches of government.",
                "12.5: Summarize landmark U.S. Supreme Court interpretations of the Constitution and its amendments."
            ],
            "Grade 12: Principles of Economics": [
                "12.1: Understand common economic terms and concepts and economic reasoning.",
                "12.2: Analyze the elements of America's market economy in a global setting.",
                "12.3: Analyze the influence of the federal government on the American economy."
            ]
        },
        "Colorado": {
            "High School History": [
                "SS.HS.1.1: Apply historical inquiry to formulate questions, evaluate sources, and argue with textual evidence.",
                "SS.HS.1.1.b: Gather and analyze historical information from perspectives of historically underrepresented groups.",
                "SS.HS.1.1.d: Construct and defend a historical argument that evaluates interpretations by synthesizing evidence.",
                "SS.HS.1.2: Analyze and evaluate key concepts of continuity and change in the US from Reconstruction to the present.",
                "SS.HS.1.2.e: Investigate development and impact of major scientific and technological innovations in Industrial/Space/Digital ages.",
                "SS.HS.1.2.g: Analyze origins of political debates (suffrage, civil rights, role of government) and national unity.",
                "SS.HS.1.3: Analyze and evaluate key concepts of continuity and change from the Renaissance to the present."
            ],
            "High School Geography": [
                "SS.HS.2.1: Use maps and geographic tools to find patterns in human systems and physical features.",
                "SS.HS.2.3: Determine how physical and political features impact cultural diffusion, regional differences, and trade."
            ]
        },
        "Connecticut": {
            "Grade 8: United States History II": [
                "Outcome 1: Origins of United States Democracy and National Identity.",
                "Outcome 2: Expansion, Influence, and Economic Growth."
            ],
            "Modern World History": [
                "Outcome 1: Analyze how exchange of ideas, goods, and pathogens has shaped world history.",
                "Outcome 2: Evaluate impact of Enlightenment ideas on political revolutions in the 18th and 19th centuries.",
                "Outcome 3: Analyze the social, economic, and political effects of industrialization."
            ],
            "US History III: Reconstruction–Digital Age": [
                "Outcome 1: Evaluate successes and failures of Reconstruction and its lasting impact on civil rights.",
                "Outcome 2: Analyze transformation of American economy and society during late 19th and early 20th centuries."
            ]
        },
        "Delaware": {
            "Grades 9-12 Civics": [
                "Civics 1: Analyze ways government structures reflect differing ideologies, cultures, values, and histories.",
                "Civics 2: Understand that the US government operates under checks and balances and separation of powers.",
                "Civics 3: Understand that rights of citizens are secured by the Bill of Rights and other amendments.",
                "Civics 4: Develop and employ skills necessary to participate in the political process."
            ],
            "Grades 9-12 Economics": [
                "Economics 1: Analyze how economic systems allocate scarce resources.",
                "Economics 2: Analyze the role of markets and prices in the economy.",
                "Economics 3: Analyze the role of money and banking in the economy.",
                "Economics 4: Analyze the role of government in the economy."
            ],
            "Grades 9-12 Geography": [
                "Geography 1: Demonstrate ability to use maps, globes, and tools to locate information about people and places.",
                "Geography 2: Develop knowledge of distinctive and common characteristics of physical and human places."
            ],
            "Grades 9-12 History": [
                "History 1: Employ chronological concepts in analyzing historical phenomena.",
                "History 2: Gather, examine, and analyze historical data from major events in world, US, and Delaware history.",
                "History 3: Interpret historical data and develop historical knowledge."
            ]
        },
        "Florida": {
            "United States History (2100310)": [
                "SS.912.A.1.4: Analyze how imagery and artwork may be used to interpret significance of time periods and events.",
                "SS.912.A.1.5: Evaluate validity, reliability, bias, and authenticity of current events and Internet resources.",
                "SS.912.A.2.3: Describe issues that divided Republicans during the early Reconstruction era.",
                "SS.912.A.2.4: Distinguish freedoms guaranteed to African Americans by the 13th, 14th, and 15th Amendments.",
                "SS.912.A.2.5: Assess economic and social consequences of the Industrial Revolution."
            ],
            "United States Government (2106310)": [
                "Outcome 1: Identify grievances in Declaration of Independence (due process, individual rights, natural rights).",
                "Outcome 2: Explain Enlightenment ideas in Declaration (sovereignty, self-evident truth, limited government).",
                "Outcome 3: Explain origins of political parties and evaluate their roles in shaping public policy.",
                "Outcome 4: Differentiate between government systems (autocracy, democracy, monarchy, republic).",
                "Outcome 5: Explain how policies of other nations influence U.S. policy and society."
            ]
        },
        "Georgia": {
            "United States History": [
                "SSUSH1: Compare and contrast development of English settlement and colonization during the 17th Century.",
                "SSUSH2: Describe early English colonial society and investigate development of governance.",
                "SSUSH3: Analyze the causes of the American Revolution.",
                "SSUSH4: Analyze ideological, military, social, and diplomatic aspects of American Revolution.",
                "SSUSH5: Investigate specific events and ideas that brought about adoption of the U.S. Constitution.",
                "SSUSH6: Analyze challenges faced by first five presidents and their responses.",
                "SSUSH8: Explore relationship between slavery, North-South divisions, and westward expansion.",
                "SSUSH9: Evaluate key events, issues, and individuals related to the Civil War.",
                "SSUSH10: Identify legal, political, and social dimensions of Reconstruction.",
                "SSUSH18: Evaluate Franklin D. Roosevelt's New Deal as a response to the Great Depression.",
                "SSUSH23: Assess political, economic, and technological changes from Reagan to Obama administrations."
            ]
        },
        "Hawaii": {
            "Social Studies Outcomes": [
                "SS.9-12.C.1: Evaluate how the U.S. Constitution establishes a system of government that has powers, responsibilities, and limits.",
                "SS.9-12.C.2: Analyze the role of citizens in the U.S. political system.",
                "Personal Finance: Apply self-knowledge to identify personal values, skills, and interests and make decisions.",
                "Ethics: Recognize importance of ethics and how ethical/unethical choices affect everyone in a community."
            ]
        },
        "Idaho": {
            "High School Social Studies": [
                "Standard 1: Understand basic North American geography, peoples, and cultures prior to European colonization.",
                "Standard 2: Understand the origins of the American Revolution and its impact on the founding of the US.",
                "Standard 3: Understand the US Constitution and Bill of Rights and their impact on early political development.",
                "Standard 4: Analyze relationships and interactions within and between human and physical systems.",
                "Standard 5: Understand the causes and consequences of territorial expansion of the United States.",
                "Standard 6: Understand the causes and consequences of nineteenth-century sectionalism, the Civil War, and Reconstruction."
            ]
        },
        "Illinois": {
            "High School Inquiry": [
                "Essential Questions: Construct essential questions that help to organize and frame an inquiry.",
                "Supporting Questions: Construct supporting questions to develop knowledge and thinking relative to key concepts.",
                "Claims and Evidence: Construct a claim that answers a compelling question and support it with evidence."
            ],
            "High School History": [
                "SS.9-12.H.2: Analyze change and continuity across historical eras and influence of perspectives.",
                "SS.9-12.H.4: Analyze interaction with environmental, scientific, technological, and societal challenges.",
                "SS.9-12.H.6: Analyze concept of the 'American Dream' and barriers for multiple groups of people.",
                "SS.9-12.H.8: Analyze key historical events through variety of perspectives, including underrepresented groups.",
                "SS.9-12.H.11: Analyze primary/secondary sources to identify dominant narratives and counternarratives."
            ]
        },
        "Indiana": {
            "United States History (1877-Present)": [
                "USH.1.1: Explain constitutional issues in the post-Civil War era (federalism, separation of powers, checks and balances).",
                "USH.1.2: Describe social, political, and economic changes resulting from the Reconstruction era.",
                "USH.2.1: Explain causes and consequences of the Great Depression (crash, banking failures, Dust Bowl).",
                "USH.2.3: Analyze the impact of the New Deal on the United States economy and society.",
                "USH.5.1: Analyze the origins, development, and consequences of the Cold War."
            ]
        },
        "Iowa": {
            "High School Inquiry Anchor": [
                "SS.9-12.1: Create compelling questions for inquiry.",
                "SS.9-12.2: Critique the relationship between compelling and supporting questions.",
                "SS.9-12.3: Gather relevant information from multiple sources representing a wide range of views.",
                "SS.9-12.4: Evaluate credibility of a source by examining how experts value the source."
            ]
        },
        "Kansas": {
            "Benchmark Outcomes": [
                "1.1: Recognize and evaluate significant choices and consequences that have impacted lives and futures.",
                "1.2: Analyze the context and draw conclusions about choices and consequences.",
                "2.1: Recognize and evaluate the rights and responsibilities of people living in societies.",
                "2.2: Analyze the context and draw conclusions about rights and responsibilities.",
                "3.1: Recognize and evaluate how societies are shaped by identities, beliefs, and practices of individuals/groups.",
                "4.1: Recognize and evaluate continuity and change over time.",
                "5.1: Recognize and evaluate dynamic relationships among people, places, ideas, and environments."
            ]
        },
        "Kentucky": {
            "High School United States History": [
                "HS.UH.I.Q.1: Generate compelling questions to develop knowledge and thinking relative to key concepts.",
                "HS.UH.CH.1: Analyze impact of economic institutions (Fed, property rights) on development to an industrial state.",
                "HS.UH.CH.2: Analyze how involvement in global conflicts (WWI, WWII, Cold War) influenced US role in world affairs.",
                "HS.UH.CH.3: Analyze the impact of social movements (Civil Rights, Women's Rights) on United States society."
            ]
        },
        "Louisiana": {
            "High School United States History": [
                "US.1: Analyze ideas and events in US history from 1776 to 2008 and how they progressed or changed.",
                "US.2: Analyze connections between events and developments in U.S. history within their global context.",
                "US.3: Compare and contrast events and developments in U.S. history from 1776 to 2008.",
                "US.4: Use geographic representations and demographic data to analyze environmental and political changes.",
                "US.5: Use variety of sources to analyze content, evaluate claims, and compare accounts.",
                "US.7.a: Explain historical context of events leading to Declaration of Independence signed.",
                "US.7.c: Analyze the Declaration of Independence and how ideas reflect values of the founders."
            ],
            "High School Civics": [
                "C.1: Evaluate continuity and change in US government, politics, and civic issues.",
                "C.2: Analyze causes and effects of developments that influenced laws, processes, and civic participation.",
                "C.5: Evaluate fundamental principles (due process, equal justice, federalism, individual responsibility)."
            ]
        },
        "Maine": {
            "Civics and Government": [
                "Outcome 1: Understand basic values and principles of American democracy.",
                "Outcome 2: Explain that history study of past experience is based on variety of primary/secondary sources.",
                "Civic Action: Make decisions related to the state of Maine or civic organizations."
            ]
        },
        "Maryland": {
            "Standard 1.0: Civics": [
                "Civics: Inquire about historical development of authority, power, and influence with emphasis on civic reasoning."
            ],
            "Standard 2.0: Peoples": [
                "Peoples of the Nations: Inquire about people using historically grounded approach to recognize multiple narratives."
            ],
            "Standard 5.0: History": [
                "History: Inquire about significant events/ideas to identify patterns and analyze change over time."
            ]
        },
        "Massachusetts": {
            "United States History I (Grade 9)": [
                "Outcome 1: Analyze historical and intellectual origins of the US during Revolutionary and Constitutional eras.",
                "Outcome 2: Examine causes and consequences of Civil War, Industrialization, Immigration, and Progressivism.",
                "Outcome 3: Analyze framework of American democracy (sovereignty, federalism, separation of powers, individual rights)."
            ],
            "United States History II (Grade 11)": [
                "Outcome 1: Analyze causes and consequences of the Great Depression and the New Deal.",
                "Outcome 2: Analyze important social, political, economic, and military developments of the Cold War era.",
                "Outcome 3: Analyze origins/consequences of Industrial Revolution, European reforms, and imperialism."
            ],
            "Modern World History (Grade 10)": [
                "Outcome 1: Survey World History from the French Revolution to the present day.",
                "Outcome 2: Examine military/economic events (WWI, Depression, WWII, Cold War, Russian/Chinese revolutions)."
            ]
        },
        "Michigan": {
            "United States History and Geography": [
                "F1.1: Identify core ideals of American society in Declaration of Independence and analyze movement toward/away.",
                "6.1.1: Explain causes and consequences of the Great Depression, including stock market crash and Dust Bowl.",
                "F1.2: Use American Revolution, Constitution, and Civil War as touchstones for argument."
            ]
        },
        "Minnesota": {
            "High School Outcomes": [
                "9.1.1.1.1: Demonstrate civic skills in a real-world context.",
                "9.3.1.1.1: Use maps and geospatial technologies to evaluate impact of geographic factors on human systems.",
                "9.4.1.2.1: Pose questions, examine sources, interpret findings, and use evidence to draw conclusions.",
                "9.4.1.2.2: Evaluate credibility of internet sources by determining how/why created."
            ]
        },
        "Mississippi": {
            "United States History (1877-Present)": [
                "US.1: Analyze the transformation of the United States from an agrarian to an industrial society.",
                "US.5: Analyze the Civil Rights Movement to determine its impact on the United States.",
                "US.6: Analyze the impact of the Cold War on the United States."
            ],
            "Civil Rights Strand": [
                "Tactics: Acquire knowledge of tactics engaged by activists (demonstrations, resistance, collective action)."
            ]
        },
        "Missouri": {
            "American History": [
                "9-12.AH.1.CC.A: Create and use tools to analyze a chronological sequence of related events in US history.",
                "9-12.AH.3.GS.C: Compare and contrast programs/policies of the New Deal and Great Society.",
                "9-12.AH.2.GS.A: Analyze role of the United States in the world wars and the Cold War."
            ]
        },
        "Montana": {
            "High School Outcomes": [
                "SS.H.12.3: Analyze the historical development of the United States Constitution.",
                "SS.H.12.4: Analyze multiple and complex causal factors that have shaped major events in US and world history.",
                "SS.CG.12.4: Define sovereignty for tribes in Montana and explain how it is exercised.",
                "SS.H.12.1: Identify ways in which people and groups exercise agency in difficult contexts."
            ]
        },
        "Nebraska": {
            "High School Civics": [
                "SS HS.1.1.a: Examine the historical foundation that influenced the creation of the United States Constitution.",
                "SS HS.1.1.b: Evaluate the structure of American constitutional government.",
                "SS HS.1.1.c: Analyze the functions of United States government and its outcomes.",
                "SS HS.1.2.a: Investigate how individuals/groups use government structures to shape policy."
            ]
        },
        "Nevada": {
            "High School US History": [
                "SS.9-12.US.14: Analyze impact of personal interests on application of civic virtues and constitutional rights.",
                "SS.9-12.US.26: Analyze the effects of the Cold War on the United States.",
                "SS.9-12.US.10: Participate in rigorous academic discussions emphasizing multiple viewpoints."
            ]
        },
        "New Hampshire": {
            "Civics (Grade 8/High School)": [
                "SS:CV:8:2.1: Demonstrate understanding of major provisions of US and NH Constitutions.",
                "SS:HI:8:1.1: Examine how suffrage expanded to various groups of citizens (women, African Americans).",
                "SS:HI:8:1.4: Analyze tension between states' rights and national authority (nullification crisis)."
            ]
        },
        "New Jersey": {
            "6.1 US History: America in the World": [
                "Outcomes: Acquire knowledge and skills to think analytically about interactions of people, cultures, and environment."
            ],
            "6.3 Active Citizenship in the 21st Century": [
                "Outcomes: Acquire skills needed to be active, informed citizens who value diversity and promote cultural understanding."
            ]
        },
        "New Mexico": {
            "High School Civics": [
                "9-12.Civ.13: Distinguish powers and responsibilities of local, state, Indigenous, and national institutions.",
                "9-12.Civ.20: Use data/evidence related to federal policy toward Indigenous groups over time.",
                "9-12.Civ.14: Develop claims about purpose, processes, strengths, and weaknesses of the US government.",
                "9-12.Civ.15: Evaluate efforts to adapt and redesign the U.S. Constitution and political institutions."
            ]
        },
        "New York": {
            "Global History and Geography II (Grade 10)": [
                "10.1: THE WORLD IN 1750: Marked by powerful Eurasian states, coastal African kingdoms, and European maritime power.",
                "10.2: ENLIGHTENMENT, REVOLUTION, AND NATIONALISM: Questioning traditional beliefs and inspiring change.",
                "10.3: CAUSES AND EFFECTS OF INDUSTRIAL REVOLUTION: Innovations in agriculture and production spreading globally.",
                "10.7: DECOLONIZATION AND NATIONALISM (1900–2000): Nationalist movements employing nonviolent resistance and struggle."
            ]
        },
        "North Carolina": {
            "Civic Literacy": [
                "FP.C&G.2.1: Analyze structure of governments to maintain order, security, and protection of citizens.",
                "FP.C&G.2.3: Evaluate the U.S. Constitution as a 'living Constitution' interpreted and applied over time.",
                "FP.C&G.2.6: Summarize balance between individual rights and authority of governments (Bill of Rights)."
            ]
        },
        "North Dakota": {
            "High School United States History": [
                "Instruction: Include mandated unit on Native American story, contributions, tribal relations, and sovereignty."
            ],
            "Civics and Government": [
                "ND.6_12.4.1: Identify Native American groups in North Dakota before European contact and describe culture."
            ]
        },
        "Ohio": {
            "American Government": [
                "Content Statement 1: Opportunities for civic engagement within formats of government through policy processes.",
                "Content Statement 6: The US Constitution established foundations of the American nation.",
                "Content Statement 16: Racial intolerance, anti-immigrant attitudes, and Red Scare social unrest after WWI.",
                "Content Statement 7: Federalist and Anti-Federalist Papers debate over protections and Bill of Rights."
            ]
        },
        "Oklahoma": {
            "United States History": [
                "USH.1: Analyze transformation of the US through civil rights struggles and immigrant experiences.",
                "USH.1.3: Analyze the impact of the 13th, 14th, and 15th Amendments.",
                "USH.6: Analyze foreign and domestic policies of the United States since the end of the Cold War."
            ]
        },
        "Oregon": {
            "High School Civics": [
                "HS.C.PI.1: Investigate and compare early governments influential to US structure.",
                "HS.2: Identify and analyze existence and perpetuation of discrimination and inequity.",
                "HS.C.PI.7: Compare core documents associated with the protection of individual rights.",
                "HS.9: Analyze political parties, interest groups, and mass media influence on beliefs and behavior."
            ]
        },
        "Pennsylvania": {
            "Civics and Government": [
                "5.1.12.A: Analyze sources, purposes, and functions of law (constitutional, civil, criminal).",
                "5.1.12.B: Employ historical examples to evaluate major arguments for necessity of government.",
                "5.1.12.C: Evaluate application of principles and ideals in contemporary civic life."
            ],
            "History": [
                "8.1.12.A: Evaluate historical interpretation of events.",
                "8.1.12.B: Evaluate interpretation of sources considering fact vs opinion and multiple perspectives."
            ]
        },
        "Rhode Island": {
            "High School Civics": [
                "Civics 1: Distinguish powers and responsibilities of local, tribal, national, and international institutions.",
                "Civics 2: Analyze the role of citizens in the U.S. political system with attention to democracy theories.",
                "Civics 4: Explain how the US Constitution establishes system of government that has changed over time."
            ]
        },
        "South Carolina": {
            "United States History": [
                "USHC.1: Analyze development of American identity through Northern and Southern colonies.",
                "USHC.2: Assess major developments of the American Revolution through turning points in debates.",
                "USHC.3: Analyze impact of Civil War and Reconstruction on American systems."
            ]
        },
        "South Dakota": {
            "High School Civics": [
                "9-12.C.1.C: Write persuasive essays on historical topics in American government based on class notes.",
                "9-12.C.3.M: Use primary sources (John Locke) to investigate influence on American founders.",
                "9-12.C.4.E: Explain the meaning of 'created equal' and founders' arguments for dignity and rights.",
                "9-12.C.5.H: Explain the representative or republican form of government compared to direct democracy."
            ]
        },
        "Tennessee": {
            "United States History": [
                "US.01: Explain the causes and consequences of the Industrial Revolution.",
                "US.02: Analyze impact of big business, labor unions, and technological innovations.",
                "US.23: Assess political and economic changes from Reagan to Obama administrations."
            ]
        },
        "Texas": {
            "United States History Studies Since 1877": [
                "1(A): Analyze and evaluate text, intent, and meaning of Declaration of Independence and Constitution.",
                "2(A): Identify major eras in U.S. history from 1877 to present and their defining characteristics.",
                "3(A): Analyze political issues such as Indian policies, growth of political machines, and service reform.",
                "9(F): Discuss impact of writings of Martin Luther King Jr. ('I Have a Dream', 'Letter from Birmingham Jail')."
            ],
            "Economics": [
                "1(A): Explain why scarcity and choice are basic economic problems faced by every society.",
                "4(A): Explain basic characteristics of economic systems (property rights, incentives, role of government)."
            ]
        },
        "Utah": {
            "United States History II": [
                "Standard 4.1: Develop interpretation of why cultural clashes occurred in 1920s (religion vs science, Prohibition).",
                "Standard 4.2: Compare and evaluate effectiveness of various methods used to achieve civil rights reform.",
                "Standard 3.4: Explain causes for U.S. involvement in WWI and effects on the home front."
            ]
        },
        "Vermont": {
            "Global Citizenship": [
                "Inquiry: Use inquiry to make sense of the world by questioning and analyzing info.",
                "Civics: Act as citizens by understanding history, principles, and foundations of American democracy.",
                "Economics: Demonstrate understanding of economic decisions based on interactions between humans and systems.",
                "History: Understand change and continuity over time using historical evidence to answer questions."
            ]
        },
        "Virginia": {
            "Virginia and United States History": [
                "VUS.1a: Describe political, religious, and economic characteristics of the first thirteen colonies.",
                "VUS.7b: Describe political results of territorial expansion and impact on Indigenous Peoples.",
                "VUS.10a: Analyze how nation changed from Reconstruction to early 20th century (Westward movement)."
            ]
        },
        "Washington": {
            "High School Civics": [
                "C1: Understand key ideals and principles of the US in the Declaration and Constitution.",
                "C4: Analyze how political parties, interest groups, and media influence public policy."
            ],
            "High School History": [
                "H1: Evaluate how historical events were shaped by unique circumstances of time and place."
            ]
        },
        "West Virginia": {
            "Civics (Grade 12)": [
                "SS.12.C.1: Analyze purpose and functions of government and rights/responsibilities of citizens.",
                "SS.12.C.2: Analyze meaning and importance of the Declaration of Independence and the U.S. Constitution.",
                "SS.12.C.3: Evaluate roles of political parties, interest groups, and media in the political process."
            ]
        },
        "Wisconsin": {
            "High School History": [
                "SS.Hist1: Use historical evidence for determining cause and effect.",
                "SS.Hist2: Analyze, recognize, and evaluate patterns of continuity and change over time.",
                "SS.Hist3: Connect past events, people, and ideas to the present using different perspectives."
            ],
            "High School Political Science": [
                "SS.PS1: Identify and analyze democratic principles and ideals.",
                "SS.PS2: Examine and interpret rights, privileges, and responsibilities in society."
            ]
        },
        "Wyoming": {
            "Citizenship, Government, and Democracy": [
                "SS12.1.2: Explain and/or demonstrate the rights and responsibilities of a citizen.",
                "SS12.1.4: Demonstrate understanding of the US civil and criminal legal systems."
            ],
            "Culture and Cultural Diversity": [
                "SS12.2.2: Analyze human experience and cultural expression (language, arts, beliefs) of specific cultures."
            ]
        }
    },
    "UK": {
        "England": {
            "GCSE History": [
                "Outcome 1: Sample UK Outcome",
                "Outcome 2: Sample UK Outcome"
            ]
        }
    }
}